/*
 * 课堂练习：
 *		定义一个数组，通过键盘输入10个数字，然后逆序输出
 *		要求程序界面格式如下：
 *			****************************
 *			请输入10个数字：(在此处输入10个数字)
 *			****************************
 *			逆序输出结果：(在此处逆序输出数字)
 *			**************************** 
 */
#include<stdio.h>

void main()
{
	void print_star_line(); // 声明函数 
	
	int a[10];
	int i;
	print_star_line(); // 调用函数 
	printf("请输入10个数字：");
	for(i=0;i<10;i++)
	{
		scanf("%d",&a[i]);
	}
	print_star_line(); // 调用函数 
	printf("逆序输出结果：");
	for(i=9;i>=0;i--)
	{
		printf("%d ",a[i]);
	}
	printf("\n");
	print_star_line(); // 调用函数 
}

// 函数定义 
void print_star_line()
{
	printf("*****************************************\n");
}
